* TODO read Thinking in java 
SCHEDULED: <2016-04-27 周三  +1d>
  :PROPERTIES:
  :LAST_REPEAT: [2016-06-06 周一 22:46]
  :Effort:
  :END:
  - State "DONE"       from "TODO"       [2016-06-06 周一 22:46]683
  - State "DONE"       from "TODO"       [2016-05-26 周四 23:07]676
  - State "DONE"       from "TODO"       [2016-05-31 周二 21:04]680 
  - State "DONE"       from "TODO"       [2016-05-25 周三 22:39]674
  - State "DONE"       from "TODO"       [2016-05-19 周四 22:35]670
  - State "DONE"       from "TODO"       [2016-05-18 周三 23:36]665
  - State "DONE"       from "TODO"       [2016-05-17 周二 23:51]662
  - State "DONE"       from "TODO"       [2016-05-16 周一 23:51] 657
  - State "DONE"       from "TODO"       [2016-05-15 周日 23:09]653
  - State "DONE"       from "TODO"       [2016-05-13 周五 21:24] 194
  - State "DONE"       from "TODO"       [2016-05-12 周四 23:39]
  - State "DONE"       from "TODO"       [2016-04-27 三 04:51]
  - State "DONE"       from "TODO"       [2016-04-26  04:50]
  - State "DONE"       from "TODO"       [2016-04-13 三 23:23]
  - State "DONE"       from "TODO"       [2016-04-12 三 04:52]
  - State "DONE"       from "TODO"       [2016-04-09  02:54]
    - State "DONE"       from "TODO"       [2016-04-04 一 10:55]
  - State "DONE"       from "TODO"       [2016-03-22 周二 15:03]
  - State "DONE"       from "TODO"       [2016-03-17 周四 18:01]
  - State "DONE"       from "TODO"       [2016-03-15 周二 18:01]
  - State "DONE"       from "TODO"       [2016-03-14 周一 17:27]
  :LOGBOOK:
  CLOCK: [2016-06-06 周一 22:18]--[2016-06-06 周一 22:43] =>  0:25
  CLOCK: [2016-05-31 周二 20:39]--[2016-05-31 周二 21:04] =>  0:25
  CLOCK: [2016-05-26 周四 22:41]--[2016-05-26 周四 23:06] =>  0:25
  CLOCK: [2016-05-25 周三 22:08]--[2016-05-25 周三 22:33] =>  0:25
  CLOCK: [2016-05-19 周四 22:09]--[2016-05-19 周四 22:34] =>  0:25
  CLOCK: [2016-05-18 周三 23:08]--[2016-05-18 周三 23:33] =>  0:25
  CLOCK: [2016-05-17 周二 23:26]--[2016-05-17 周二 23:51] =>  0:25
  CLOCK: [2016-05-16 周一 23:17]--[2016-05-16 周一 23:42] =>  0:25
  CLOCK: [2016-05-15 周日 22:42]--[2016-05-15 周日 23:07] =>  0:25
  CLOCK: [2016-05-13 周五 20:58]--[2016-05-13 周五 21:23] =>  0:25
  CLOCK: [2016-05-12 周四 23:12]--[2016-05-12 周四 23:37] =>  0:25
  CLOCK: [2016-04-27 三 04:00]--[2016-04-27 三 04:25] =>  0:25
  CLOCK: [2016-04-25 一 06:24]--[2016-04-25 一 06:49] =>  0:25
  CLOCK: [2016-04-13 三 22:56]--[2016-04-13 三 23:21] =>  0:25
  CLOCK: [2016-04-13 三 04:26]--[2016-04-12 三 04:51] =>  0:25
  CLOCK: [2016-04-10 日 02:28]--[2016-04-10 日 02:53] =>  0:25
  CLOCK: [2016-04-04 一 10:25]--[2016-04-04 一 10:50] =>  0:25
  CLOCK: [2016-03-22 周二 14:36]--[2016-03-22 周二 15:01] =>  0:25
  CLOCK: [2016-03-17 周四 17:36]--[2016-03-17 周四 18:01] =>  0:25
  CLOCK: [2016-03-15 周二 17:40]--[2016-03-15 周二 18:01] =>  0:21
  CLOCK: [2016-03-14 周一 16:56]--[2016-03-14 周一 17:23] =>  0:27
  :END:
* learn android 
** TODO [[http://guides.codepath.com/android/Home#getting-started][codepath]]
   SCHEDULED: <2016-04-23 周六 +1d>
   :PROPERTIES:
   :LAST_REPEAT: [2016-04-22 周五 15:22]
   :END:
   - State "DONE"       from "TODO"       [2016-04-22 周五 15:22]
   :LOGBOOK:
   CLOCK: [2016-04-22 周五 14:57]--[2016-04-22 周五 15:22] =>  0:25
   :END:
   
** TODO basic knowledge
*** TODO Transition 完成动画切换
    SCHEDULED: <2016-06-30 周三 +1d>
    :PROPERTIES:
    :LAST_REPEAT: [2016-03-29 周二 17:12]
    :Effort:
    :END:
    - State "DONE"       from "TODO"       [2016-03-29 周二 17:12]
    :LOGBOOK:
    CLOCK: [2016-03-29 周二 16:46]--[2016-03-29 周二 17:11] =>  0:25
    :END:
    +[ ] [[https://github.com/bboyfeiyu/android-tech-frontier/blob/master/issue-35/%E7%94%A8Transition%E5%AE%8C%E6%88%90Fragment%E5%85%B1%E4%BA%AB%E5%85%83%E7%B4%A0%E7%9A%84%E5%88%87%E6%8D%A2.md][github]]    material 效果
*** DONE service
    CLOSED: [2016-04-22 周五 09:25] SCHEDULED: <2016-03-31 周四 >
    :PROPERTIES:
    :LAST_REPEAT: [2016-03-30 周三 16:30]
    :Effort:
    :END:
    - State "DONE"       from "TODO"       [2016-03-30 周三 16:30]
    - State "DONE"       from "TODO"       [2016-03-29 周二 10:08]
    - State "DONE"       from "TODO"       [2016-03-28 周一 09:43]
    - State "DONE"       from "TODO"       [2016-03-24 周四 10:52]
    - State "DONE"       from "TODO"       [2016-03-23 周三 10:24]
    :LOGBOOK:
    CLOCK: [2016-03-30 周三 16:02]--[2016-03-30 周三 16:27] =>  0:25
    CLOCK: [2016-03-28 周一 16:49]--[2016-03-28 周一 17:14] =>  0:25
    CLOCK: [2016-03-24 周四 10:22]--[2016-03-24 周四 10:47] =>  0:25
    CLOCK: [2016-03-23 周三 09:58]--[2016-03-23 周三 10:23] =>  0:25
    CLOCK: [2016-03-18 周五 14:21]--[2016-03-18 周五 14:46] =>  0:25
    :END:
    [[http://www.android-doc.com/guide/components/services.html][service]]
      
*** DONE toolBar
    CLOSED: [2016-04-22 周五 09:24]
    :LOGBOOK:
    CLOCK: [2016-03-30 周三 17:09]--[2016-03-30 周三 17:34] =>  0:25
    :END:
*** DONE Processes and Threads
    CLOSED: [2016-03-30 周三 16:43] SCHEDULED: <2016-03-30 周三 >
    :PROPERTIES:
    :LAST_REPEAT: [2016-03-29 周二 11:04]
    :END:
    - State "DONE"       from "TODO"       [2016-03-29 周二 11:04]
    - State "DONE"       from "TODO"       [2016-03-24 周四 10:09]
    - State "DONE"       from "TODO"       [2016-03-23 周三 11:10]
    :LOGBOOK:
    CLOCK: [2016-03-23 周三 10:39]--[2016-03-23 周三 11:04] =>  0:25
    :END:
**** url 
     :LOGBOOK:
     CLOCK: [2016-03-29 周二 10:20]--[2016-03-29 周二 10:45] =>  0:25
     :END:
    + [X] [[http://www.android-doc.com/guide/components/processes-and-threads.html][threads and processes 官方文档 ]]
    + 
*** DONE [[http://www.cnblogs.com/jarrah/p/3726079.htmlandroid ][拍照,图库问题]]
    CLOSED: [2016-04-22 周五 09:24]
** TODO Materal Design
   SCHEDULED: <2016-04-13 周三  +1d>
   :PROPERTIES:
   :LAST_REPEAT: [2016-04-12 周二 17:56]
   :Effort:
   :END:
   - State "DONE"       from "TODO"       [2016-04-12 周二 17:56]
   - State "DONE"       from "TODO"       [2016-04-01 周五 13:56]
   - State "DONE"       from "TODO"       [2016-03-30 周三 15:53]
   - State "DONE"       from "TODO"       [2016-03-24 周四 09:44]
   - State "DONE"       from "TODO"       [2016-03-23 周三 09:46]
   :LOGBOOK:
   CLOCK: [2016-04-12 周二 17:29]--[2016-04-12 周二 17:54] =>  0:25
   CLOCK: [2016-04-01 周五 13:30]--[2016-04-01 周五 13:55] =>  0:25
   CLOCK: [2016-03-30 周三 15:28]--[2016-03-30 周三 15:53] =>  0:25
   CLOCK: [2016-03-29 周二 11:06]--[2016-03-29 周二 11:31] =>  0:25
   CLOCK: [2016-03-24 周四 09:15]--[2016-03-24 周四 09:40] =>  0:25
   CLOCK: [2016-03-23 周三 09:15]--[2016-03-23 周三 09:40] =>  0:25
   :END:
*** url
    [[http://wiki.jikexueyuan.com/project/material-design/whatis-material-design/elevation-shadows.html][官方文档]]
** TODO DataBinding                                           :android view:
   SCHEDULED: <2016-03-25 周日 09:00-09:30 +1d>
   :PROPERTIES:
   :LAST_REPEAT: [2016-03-24 周四 11:37]
   :Effort:
   :END:
   - State "DONE"       from "TODO"       [2016-03-24 周四 11:37]
   - State "DONE"       from "TODO"       [2016-03-21 周一 17:31] 
   :LOGBOOK:
   CLOCK: [2016-03-24 周四 11:05]--[2016-03-24 周四 11:30] =>  0:25
   CLOCK: [2016-03-21 周一 16:55]--[2016-03-21 周一 17:20] =>  0:25
   :END:
*** url
    + [ ] [[file:///F:/soft/eclipse/eclipse/android-sdk/docs/tools/data-binding/guide.html][api guide]]
*** TODO mvvm
    [[http://www.open-open.com/lib/view/open1452601235308.html#_label0][data binding]]
** TODO 自定义 view
   SCHEDULED: <2016-06-13 周六 +1d>
   :PROPERTIES:
   :LAST_REPEAT: [2016-06-12 周日 17:59]
   :END:
   - State "DONE"       from "TODO"       [2016-06-12 周日 17:59]
   - State "DONE"       from "TODO"       [2016-04-21 周四 14:57]
   :LOGBOOK:
   CLOCK: [2016-06-12 周日 17:49]--[2016-06-12 周日 17:59] =>  0:10
   CLOCK: [2016-04-21 周四 13:52]--[2016-04-21 周四 14:17] =>  0:25
   :END:
*** 张鸿洋                                                     :android view:
    + [ ] [[http://blog.csdn.net/lmj623565791/article/details/24252901][自定义 view1]]
    + 
** TODO gradle                                              :gradle android:
   SCHEDULED: <2016-05-13 周五 +1d>
   :PROPERTIES:
   :LAST_REPEAT: [2016-05-27 周五 09:54]
   :END:
   - State "DONE"       from "TODO"       [2016-05-27 周五 09:54]
   - State "DONE"       from "TODO"       [2016-05-11 周三 11:50]
   :LOGBOOK:
   CLOCK: [2016-05-27 周五 09:27]--[2016-05-27 周五 09:52] =>  0:25
   CLOCK: [2016-05-11 周三 11:14]--[2016-05-11 周三 11:39] =>  0:25
   :END:
*** [[http://ask.android-studio.org/?/explore/sort_type-new__category-7__day-0][gradle]]
*** [[https://segmentfault.com/a/1190000004247809][segmentfault gradle]]
** EventBus 
   :LOGBOOK:
   CLOCK: [2016-03-17 周四 15:39]--[2016-03-17 周四 16:04] =>  0:25
   :END:
   [[http://blog.csdn.net/lmj623565791/article/details/40794879][张鸿洋]]
** Inject
   :PROPERTIES:
   :LAST_REPEAT: [2016-03-28 周一 16:29]
   :END:
   - State "DONE"       from "TODO"       [2016-03-28 周一 16:29]
   - State "DONE"       from "TODO"       [2016-03-23 周三 15:30]
   - State "DONE"       from "TODO"       [2016-03-21 周一 10:38]
   - State "DONE"       from "TODO"       [2016-03-17 周四 14:16]
   :LOGBOOK:
   CLOCK: [2016-04-14 周四 10:39]--[2016-04-14 周四 11:25] =>  0:46
   CLOCK: [2016-03-28 周一 16:01]--[2016-03-28 周一 16:26] =>  0:25
   CLOCK: [2016-03-23 周三 15:03]--[2016-03-23 周三 15:28] =>  0:25
   CLOCK: [2016-03-21 周一 10:11]--[2016-03-21 周一 10:36] =>  0:25
   CLOCK: [2016-03-18 周五 16:27]--[2016-03-18 周五 16:52] =>  0:25
   CLOCK: [2016-03-17 周四 13:45]--[2016-03-17 周四 14:10] =>  0:25
   :END:
*** url
    + [X] [[https://github.com/bboyfeiyu/android-tech-frontier/blob/master/issue-31/Android%20%E4%B8%AD%E7%9A%84%E4%BE%9D%E8%B5%96%E6%B3%A8%E5%85%A5%E6%A1%86%E6%9E%B6.md][依赖注入的简单介绍]]
    + [ ] [[http://blog.csdn.net/duo2005duo/article/details/50618171][dagger2]]
    + [ ] [[http://fernandocejas.com/2015/04/11/tasting-dagger-2-on-android/][android 10]]
      + [ ] [[http://www.jcodecraeer.com/a/anzhuokaifa/androidkaifa/2015/0519/2892.html][中文翻译]]
** DONE Retrofit   
CLOSED: [2016-06-06 周一 23:31]
*** url 
    [[http://www.tuicool.com/articles/26jUZjv][Retrofit 简单介绍]]
    [[https://futurestud.io/blog/retrofit-getting-started-and-android-client][官方文档 English]]
    [[http://www.jianshu.com/p/07dac989272c][简书]]
*** TODO 翻译
    SCHEDULED: <2016-05-19 周五 +1d>
    :PROPERTIES:
    :LAST_REPEAT: [2016-05-18 周三 14:41]
    :END:
    - State "DONE"       from "TODO"       [2016-05-18 周三 14:41]
    - State "DONE"       from "TODO"       [2016-05-05 周四 16:04]
    - State "DONE"       from "TODO"       [2016-05-04 周三 17:10]
    - State "DONE"       from "TODO"       [2016-05-03 周二 15:55]
    - State "DONE"       from "TODO"       [2016-05-03 周二 15:55]
    - State "DONE"       from "TODO"       [2016-05-03 周二 15:55]
    - State "DONE"       from "TODO"       [2016-04-22 周五 11:02]
    :LOGBOOK:
    CLOCK: [2016-05-18 周三 14:13]--[2016-05-18 周三 14:38] =>  0:25
    CLOCK: [2016-05-04 周三 16:38]--[2016-05-04 周三 17:03] =>  0:25
    CLOCK: [2016-04-22 周五 10:30]--[2016-04-22 周五 10:55] =>  0:25
    :END:
    + [ ] 10.可选的查询参数
** android structure
*** + [ ]   [[https://github.com/bboyfeiyu/android-tech-frontier/blob/master/issue-31/Android%E5%BA%94%E7%94%A8%E6%9E%B6%E6%9E%84.md][安卓应用架构 github]]
    :LOGBOOK:
    CLOCK: [2016-03-24 周四 14:41]--[2016-03-24 周四 15:10] =>  0:29
    :END:
** TODO [[http://www.jcodecraeer.com/a/anzhuokaifa/androidkaifa/2014/0304/1585.html][update]]
   SCHEDULED: <2016-05-27 周五>
   :PROPERTIES:
   :LAST_REPEAT: [2016-05-26 周四 17:53]
   :END:
   - State "DONE"       from "TODO"       [2016-05-26 周四 17:53]
   :LOGBOOK:
   CLOCK: [2016-05-26 周四 17:00]--[2016-05-26 周四 17:25] =>  0:25
   :END:
   [[https://github.com/feicien/android-auto-update][github]]
** DONE Reactive Programming
   CLOSED: [2016-04-22 周五 14:55]
*** DONE Rxbascic
    CLOSED: [2016-04-22 周五 14:55] SCHEDULED: <2016-04-19   >
    :PROPERTIES:
    :LAST_REPEAT: [2016-04-18 周一 09:44]
    :Effort:
    :END:
    - State "DONE"       from "TODO"       [2016-04-18 周一 09:44]
    - State "DONE"       from "TODO"       [2016-04-17 日 21:00]
    - State "DONE"       from "TODO"       [2016-04-15 周五 10:34]
    - State "DONE"       from "TODO"       [2016-04-14 周四 17:53]
    - State "DONE"       from "TODO"       [2016-04-13 周三 14:34]
    - State "DONE"       from "TODO"       [2016-04-12 周二 11:15]
    - State "DONE"       from "TODO"       [2016-04-11 周一 11:44]
    - State "DONE"       from "TODO"       [2016-04-09 六 20:46]
    - State "DONE"       from "TODO"       [2016-04-08 周五 10:22]
    - State "DONE"       from "TODO"       [2016-04-07 周四 11:02]
    - State "DONE"       from "TODO"       [2016-04-06 周三 16:20]
    :LOGBOOK:
    CLOCK: [2016-04-22 周五 09:29]--[2016-04-22 周五 09:54] =>  0:25
    CLOCK: [2016-04-19 周二 10:18]--[2016-04-19 周二 10:43] =>  0:25
    CLOCK: [2016-04-18 周一 09:06]--[2016-04-18 周一 09:31] =>  0:25
    CLOCK: [2016-04-17 日 20:30]--[2016-04-17 日 20:55] =>  0:25
    CLOCK: [2016-04-15 周五 10:08]--[2016-04-15 周五 10:33] =>  0:25
    CLOCK: [2016-04-14 周四 15:26]--[2016-04-14 周四 15:51] =>  0:25
    CLOCK: [2016-04-13 周三 14:04]--[2016-04-13 14:29]=>0:25
    CLOCK: [2016-04-12 周二 10:44]--[2016-04-12 周二 11:09] =>  0:25
    CLOCK: [2016-04-11 周一 09:05]--[2016-04-11 周一 09:30] =>  0:25
    CLOCK: [2016-04-09 六 20:12]--[2016-04-09 六 20:37] =>  0:25
    CLOCK: [2016-04-08 周五 09:56]--[2016-04-08 周五 10:21] =>  0:25
    CLOCK: [2016-04-07 周四 10:37]--[2016-04-07 周四 11:02] =>  0:25
    CLOCK: [2016-04-06 周三 15:34]--[2016-04-06 周三 15:59] =>  0:25
    :END:
    + [ ]rxJava [[http://rxjava.yuxingxin.com/index.html][gitbook ]]  [87%]
      + [X] 1.从.net 到 RxJava
      + [X] 2.为什么是 Observables
      + [X] 3.向响应式世界问好
      + [X] 4.过滤 Observables[0/0]
      + [X] 5.变换 Observables[6/6]
        + [X] 4.1 map
        + [X] 4.2 groupby
        + [X] 4.3 Buffer
        + [X] 4.4 window
        + [X] 4.5 cast
        + [X] 4.6 总结
      + [X] 6.组合 Observables[7/7]
        + [X] 6.1 merge
        + [X] 6.2 Zip
        + [X] 6.3 Join
        + [X] 6.4 combineLatest
        + [X] 6.5 And Then,When
        + [X] 6.6 Switch
        + [X] 6.7 startwith
      + [X] 7.Schedulers-解决 Android 主线程问题[8/8]
        + [X] 7.1 StrictMode
        + [X] 7.2 避免阻塞 I/O 的操作
        + [X] 7.3 Schedulers
        + [X] 7.4 非阻塞 io 操作
        + [X] 7.5 SubscribOn and ObserveOn
        + [X] 7.6 处理耗时任务
        + [X] 7.7 执行网络任务
        + [X] 7.8 总结
      + [-] 8.与 REST 无缝结合-RxJava 和 Retrofit [1/6]
        + [X] 8.1 项目目标
        + [ ] 8.2 Retrofit
        + [ ] 8.3 App 架构
        + [ ] 8.4 创建 Activity 类
        + [ ] 8.5 创建 RecyclerView Adapter
        + [ ] 8.6 总结
    + [ ][[https://mcxiaoke.gitbooks.io/rxdocs/content/Intro.html][rx 官方文档翻译]]  [25%]
      + [X] [[file:note/rx/1ReactiveX][1.Rx]]X
      + [ ] 2.Observables  
      + [ ]
      + [ ]
*** DONE RxJava
    CLOSED: [2016-03-31 周四 09:51]
   :PROPERTIES:
   :LAST_REPEAT: [2016-03-22 周二 15:41]
   :END:
   - State "DONE"       from "TODO"       [2016-03-18 周五 16:17]
   :LOGBOOK:
   CLOCK: [2016-03-18 周五 15:19]--[2016-03-18 周五 15:44] =>  0:25
   :END:
   [[https://github.com/yaoqinwei/android-tech-frontier/tree/master/androidweekly/%E9%82%A3%E4%BA%9B%E5%B9%B4%E6%88%91%E4%BB%AC%E9%94%99%E8%BF%87%E7%9A%84%E5%93%8D%E5%BA%94%E5%BC%8F%E7%BC%96%E7%A8%8B][那些年错过的响应式编程]]
*** DONE RxJava 看着有些难
    CLOSED: [2016-04-06 周三 15:26] SCHEDULED: <2016-04-05 >
    :PROPERTIES:
    :LAST_REPEAT: [2016-03-31 周四 09:51]
    :END:
    - State "DONE"       from "TODO"       [2016-03-31 周四 09:51]
    - State "DONE"       from "TODO"       [2016-03-24 周四 14:13]
    - State "DONE"       from "TODO"       [2016-03-22 周二 11:00]
    - State "DONE"       from "TODO"       [2016-03-21 周一 18:01]
    - State "DONE"       from "TODO"       [2016-03-18 周五 13:32]
    - State "DONE"       from "TODO"       [2016-03-17 周四 11:16]
    :LOGBOOK:
    CLOCK: [2016-03-24 周四 13:42]--[2016-03-24 周四 14:07] =>  0:25
    CLOCK: [2016-03-22 周二 10:20]--[2016-03-22 周二 10:45] =>  0:25
    CLOCK: [2016-03-21 周一 17:36]--[2016-03-21 周一 18:01] =>  0:25
    CLOCK: [2016-03-18 周五 11:35]--[2016-03-18 周五 12:00] =>  0:25
    CLOCK: [2016-03-17 周四 10:45]--[2016-03-17 周四 11:10] =>  0:25
    :END:
    + [ ] [[http://gank.io/post/560e15be2dca930e00da1083#toc_9][rx 详解]]
    [[https://github.com/bboyfeiyu/android-tech-frontier/blob/master/issue-34/%E5%9C%A8Android%E5%BC%80%E5%8F%91%E4%B8%AD%E4%BD%BF%E7%94%A8RxJava.md][在 android 开发中使用 rxjava]]
** DONE MVC&MVP
   CLOSED: [2016-05-03 周二 10:37]
      :PROPERTIES:
      :LAST_REPEAT: [2016-04-05 周二 09:55]
      :END:
      - State "DONE"       from "TODO"       [2016-04-05 周二 09:55]
      - State "DONE"       from "TODO"       [2016-03-23 周三 15:00]
       - State "DONE"       from "TODO"       [2016-03-19 六 17:16]
      :LOGBOOK:
      CLOCK: [2016-04-05 周二 09:28]--[2016-04-05 周二 09:53] =>  0:25
      CLOCK: [2016-03-19 六 16:49]--[2016-03-19 六 17:14] =>  0:25
      :END:
*** url
**** DONE [[http://mp.weixin.qq.com/s?__biz=MzA3ODg4MDk0Ng==&mid=403539764&idx=1&sn=d30d89e6848a8e13d4da0f5639100e5f&scene=0][GoogleMvp]]
     CLOSED: [2016-05-03 周二 10:37] SCHEDULED: <2016-04-15 周五 >
     :PROPERTIES:
     :LAST_REPEAT: [2016-04-14 周四 10:06]
     :Effort:
     :END:
     - State "DONE"       from "TODO"       [2016-04-14 周四 10:06]
     - State "DONE"       from "TODO"       [2016-04-13 周三 17:31]
     :LOGBOOK:
     CLOCK: [2016-04-14 周四 09:24]--[2016-04-14 周四 09:49] =>  0:25
     CLOCK: [2016-04-13 周三 17:05]--[2016-04-13 周三 17:30] =>  0:25
     :END:
     
**** DONE [[http://blog.csdn.net/lmj623565791/article/details/46596109][ 张鸿洋]]


     CLOSED: [2016-03-23 周三 14:28]
    
** DONE LeakCanary
   CLOSED: [2016-04-22 周五 09:24]
*** [[http://www.liaohuqiu.net/cn/posts/leak-canary-read-me/][leakcanry 中文使用说明]]
** TODO weixin pay
   SCHEDULED: <2016-05-19 周四 +1d>
   :PROPERTIES:
   :LAST_REPEAT: [2016-05-18 周三 10:19]
   :END:
   - State "DONE"       from "TODO"       [2016-05-18 周三 10:19]
   :LOGBOOK:
   CLOCK: [2016-06-03 周五 16:24]--[2016-06-03 周五 16:49] =>  0:25
   CLOCK: [2016-05-18 周三 09:53]--[2016-05-18 周三 10:18] =>  0:25
   :END:
   [[http://blog.csdn.net/jiangwei0910410003/article/details/50402000][android 签名机制]]
** [[https://io2015codelabs.appspot.com/codelabs/android-studio-testing#2][单元测试]]
* TODO read a mind for numbers 
  SCHEDULED: <2016-04-16 周六 08:30-09:00 +1d>
  :PROPERTIES:
  :LAST_REPEAT: [2016-04-15 周五 10:07]
  :END:
  - State "DONE"       from "TODO"       [2016-04-15 周五 10:07]
  - State "DONE"       from "TODO"       [2016-04-14 周四 09:10]
  - State "DONE"       from "TODO"       [2016-04-13 周三 09:02]
  - State "DONE"       from "TODO"       [2016-04-11 周一 11:45]
  - State "DONE"       from "TODO"       [2016-04-09 六 22:07]
  - State "DONE"       from "TODO"       [2016-04-08 周五 09:51]
  - State "DONE"       from "TODO"       [2016-04-07 周四 09:01]
  - State "DONE"       from "TODO"       [2016-04-06 周三 09:02]
  - State "DONE"       from "TODO"       [2016-04-05 周二 09:04]
  - State "DONE"       from "TODO"       [2016-04-04 一 10:23]
  - State "DONE"       from "TODO"       [2016-03-30 周三 09:02]
  - State "DONE"       from "TODO"       [2016-03-29 周二 09:00]
  - State "DONE"       from "TODO"       [2016-03-28 周一 09:03]
  - State "DONE"       from "TODO"       [2016-03-24 周四 09:08]
  - State "DONE"       from "TODO"       [2016-03-23 周三 09:07]
  - State "DONE"       from "TODO"       [2016-03-22 周二 15:11]
  - State "DONE"       from "TODO"       [2016-03-17 周四 08:56]
  - State "DONE"       from "TODO"       [2016-03-16 周三 09:00]
  - State "DONE"       from "TODO"       [2016-03-15 周二 09:01]
  :PROPERTIES:
  :LAST_REPEAT: [2016-03-15 周二 09:01]
  :END:
  :LOGBOOK:
  CLOCK: [2016-04-15 周五 08:35]--[2016-04-15 周五 09:00] =>  0:25
  CLOCK: [2016-04-14 08:45]--[2016-04-14 09:01] => 0:17
  CLOCK: [2016-04-13 周三 08:49]--[2016-04-13 周三 09:02] =>  0:13
  CLOCK: [2016-04-11 周一 08:42]--[2016-04-11 周一 09:02] =>  0:20
  CLOCK: [2016-04-09 六 21:35]--[2016-04-09 六 22:00] =>  0:25
  CLOCK: [2016-04-08 周五 08:41]--[2016-04-08 周五 09:01] =>  0:20
  CLOCK: [2016-04-07 周四 08:34]--[2016-04-07 周四 08:59] =>  0:25
  CLOCK: [2016-04-06 周三 08:41]--[2016-04-06 周三 09:02] =>  0:21
  CLOCK: [2016-04-05 8:40]--[2016-04-05 9:00] =>0:20
  CLOCK: [2016-04-04 一 09:40]--[2016-04-04 一 10:05] =>  0:25
  CLOCK: [2016-03-31 周四 13:18]--[2016-03-31 周四 13:30] =>  0:12
  CLOCK: [2016-03-30 周三 08:38]--[2016-03-30 周三 09:02] =>  0:24
  CLOCK: [2016-03-29 周二 08:34]--[2016-03-29 周二 08:59] =>  0:25
  CLOCK: [2016-03-24 周四 08:48]--[2016-03-24 周四 09:08] =>  0:20
  CLOCK: [2016-03-23 周三 08:46]--[2016-03-23 周三 09:07] =>  0:21
  CLOCK: [2016-03-22 周二 08:39]--[2016-03-22 周二 09:04] =>  0:25
  CLOCK: [2016-03-18 周五 08:40]--[2016-03-18 周五 09:05] =>  0:25
  CLOCK: [2016-03-17 周四 08:25]--[2016-03-17 周四 08:50] =>  0:25
  CLOCK: [2016-03-16 周三 08:43]--[2016-03-16 周三 09:00] =>  0:17
  CLOCK: [2016-03-15 周二 08:39]--[2016-03-15 周二 09:01] =>  0:22
  :END:
   
* work
  :LOGBOOK:
  CLOCK: [2016-03-17 周四 14:32]--[2016-05-26 周四 09:09] => 1674:37
  CLOCK: [2016-03-17 周四 09:55]--[2016-03-17 周四 10:20] =>  0:25
  CLOCK: [2016-03-17 周四 09:24]--[2016-03-17 周四 09:49] =>  0:25
  :END:
* TODO sport
  SCHEDULED: <2016-05-01   +1d>
  :PROPERTIES:
  :LAST_REPEAT: [2016-05-01 日 21:57]
  :END:
  - State "DONE"       from "TODO"       [2016-04-30 日 21:57]
  - State "DONE"       from "TODO"       [2016-04-29 日 21:19]
  - State "DONE"       from "TODO"       [2016-04-28 日 21:19]
  - State "DONE"       from "TODO"       [2016-04-27 三 05:53]
  - State "DONE"       from "TODO"       [2016-04-09 六 20:49]
  - State "DONE"       from "TODO"       [2016-04-06  02:12]
  :LOGBOOK:
  CLOCK: [2016-05-01 日 21:22]--[2016-05-01 日 21:47] =>  0:25
  CLOCK: [2016-04-30  21:19]--[2016-04-30 21:44] =>  0:25
  CLOCK: [2016-04-27 三 05:06]--[2016-04-27 三 05:31] =>  0:25
  CLOCK: [2016-04-09 ]--[2016-04-09] =>  0:25
  CLOCK: [2016-04-06]--[2016-04-06] =>0:25
  CLOCK: [2016-03-19 六 17:22]--[2016-03-19 六 17:47] =>  0:25
:END:
* learn python
** TODO [[https://wizardforcel.gitbooks.io/think-python-2e/content/][think python 2e]]
   SCHEDULED: <2016-05-18 周三   +1d>
   :PROPERTIES:
   :LAST_REPEAT: [2016-06-08 周三 15:31]
   :END:
   - State "DONE"       from "TODO"       [2016-06-08 周三 15:31]
   - State "DONE"       from "TODO"       [2016-06-03 周五 14:42]
   - State "DONE"       from "TODO"       [2016-06-02 周四 14:04]
   - State "DONE"       from "TODO"       [2016-05-27 周五 15:13]
   - State "DONE"       from "TODO"       [2016-05-26 周四 15:41]
   - State "DONE"       from "TODO"       [2016-05-23 周一 17:02]
   - State "DONE"       from "TODO"       [2016-05-11 周三 15:41]
   - State "DONE"       from "TODO"       [2016-05-10 周二 10:50]
   - State "DONE"       from "TODO"       [2016-05-05 周四 14:12]
   - State "DONE"       from "TODO"       [2016-05-04 周三 14:16]
   - State "DONE"       from "TODO"       [2016-05-03 周二 14:19]
   - State "DONE"       from "TODO"       [2016-04-29 周五 14:37]
   - State "DONE"       from "TODO"       [2016-04-28 四 20:45]
   - State "DONE"       from "TODO"       [2016-04-27 周三 18:00]
   - State "DONE"       from "TODO"       [2016-04-26 周二 18:01]
   - State "DONE"       from "TODO"       [2016-04-22 周五 14:11]
   - State "DONE"       from "TODO"       [2016-04-20 周三 16:06]
   - State "DONE"       from "TODO"       [2016-04-19 周二 18:01]
   - State "DONE"       from "TODO"       [2016-04-18 周一 11:24]
   - State "DONE"       from "TODO"       [2016-04-12 周二 13:14]
   - State "DONE"       from "TODO"       [2016-04-11 周一 11:43]
   :LOGBOOK:
   CLOCK: [2016-06-03 周五 11:30]--[2016-06-03 周五 11:55] =>  0:25
   CLOCK: [2016-06-02 周四 13:39]--[2016-06-02 周四 14:04] =>  0:25
   CLOCK: [2016-05-23 周一 16:36]--[2016-05-23 周一 17:01] =>  0:25
   CLOCK: [2016-05-11 周三 15:14]--[2016-05-11 周三 15:39] =>  0:25
   CLOCK: [2016-05-10 周二 10:12]--[2016-05-10 周二 10:37] =>  0:25
   CLOCK: [2016-05-06 周五 14:15]--[2016-05-06 周五 14:40] =>  0:25
   CLOCK: [2016-05-05 周四 13:34]--[2016-05-05 周四 13:59] =>  0:25
   CLOCK: [2016-04-29 周五 14:07]--[2016-04-29 周五 14:32] =>  0:25
   CLOCK: [2016-04-28 周四 16:02]--[2016-04-28 周四 16:27] =>  0:25
   CLOCK: [2016-04-26 周二 16:52]--[2016-04-26 周二 17:17] =>  0:25
   CLOCK: [2016-04-22 周五 13:32]--[2016-04-22 周五 13:57] =>  0:25
   CLOCK: [2016-04-21 周四 15:41]--[2016-04-21 周四 16:06] =>  0:25
   CLOCK: [2016-04-20 周三 15:32]--[2016-04-20 周三 15:57] =>  0:25
   CLOCK: [2016-04-19 周二 17:25]--[2016-04-19 周二 17:50] =>  0:25
   CLOCK: [2016-04-18 周一 10:45]--[2016-04-18 周一 11:10] =>  0:25
   CLOCK: [2016-04-12 周二 11:36]--[2016-04-12 周二 12:01] =>  0:25
   CLOCK: [2016-04-11 周一 11:13]--[2016-04-11 周一 11:38] =>  0:25
   :END:
*** TODO python[58%]
    :LOGBOOK:
    CLOCK: [2016-06-08 周三 13:54]--[2016-06-08 周三 14:19] =>  0:25
    CLOCK: [2016-05-27 周五 14:30]--[2016-05-27 周五 14:55] =>  0:25
    CLOCK: [2016-05-26 周四 15:10]--[2016-05-26 周四 15:35] =>  0:25
    CLOCK: [2016-05-04 周三 13:46]--[2016-05-04 周三 14:11] =>  0:25
    CLOCK: [2016-05-03 周二 13:42]--[2016-05-03 周二 14:07] =>  0:25
    :END:
   + [X] 6. 有返回值的函数[3/3]
     + [X] 6.7 斐波那契数列
     + [X] 6.8 检查类型
     + [X] 6.9 调试
   + [X] 7. 迭代[3/3]
     + [X] 7.1 再赋值
     + [X] 7.2 更新变量
     + [X] 7.3 循环 while 语句
   + [X] 8. 字符串[10/10]
     + [X] 8.1 字符串是序列
     + [X] 8.2 len 长度
     + [X] 8.3 字符串遍历
     + [X] 8.4 字符串切片
     + [X] 8.5 字符串不可修改
     + [X] 6. 搜索
     + [X] 7. 循环和计数
     + [X] 8. 字符串方法
     + [X] 9. 运算符 in
     + [X] 10.字符串的对比
   + [-] 9. 单词游戏
     + [-] 1.读取字符列表
       + [X] 练习 1
       + [X] 2
       + [ ] 3
       + [ ] 4
       + [ ] 5
       + [ ] 6
   + [X] 10.列表[13/13]
     + [X] 1.
     + [X] 2 列表的元素可以修改
     + [X] 3.遍历列表
     + [X] 4.列表运算符
     + [X] 5.列表切片
     + [X] 6.列表的方法
     + [X] 7.列表中最重要的三种运算 map filter reduce
     + [X] 8.删除元素
     + [X] 9.列表和字符串
     + [X] 10.对象和值
     + [X] 11.别名
     + [X] 12.列表参数
     + [X] 13.debug 调试
   + [X] 11.字典[8/8]
     + [X] 1.字典是一种映射
     + [X] 2.用字典作为计数器
     + [X] 3.循环与字典
     + [X] 4.逆向查找
     + [X] 5.字典和列表
     + [X] 6.Memos 备忘 known={0:0,1:1}
     + [X] 7.全局变量
     + [X] 8.调试
   + [X] 12.元组[8/8]
     + [X] 1.元组不可修改
     + [X] 2.元组赋值
     + [X] 3.用元组做返回值
     + [X] 4.参数长度可变的元组
     + [X] 5.列表和元组
     + [X] 6.词典与元组
     + [X] 7.序列的序列
     + [X] 8.调试 structshape mode [[http://greenteapress.com/thinkpython2/code/structshape.py][link]]
   + [ ] 13.数据结构的选择
     + [ ] 1.word frequency analysis
   + [-] 14.文件[9/11]
     + [X] 1.持久
     + [X] 2.读写文件
     + [X] 3.格式运算符
     + [X] 4.文件名与路径
     + [X] 5.捕获异常
     + [X] 6.数据库
     + [X] 7.Pickling Pickle 模块
     + [X] 8.管道
     + [X] 9.编写模块
     + [ ] 10.调试
     + [ ] 12.练习
   + [-] 15.类和对象[7/8]
     + [X] 1.用户自定义类型
     + [X] 2.属性
     + [X] 3.矩形
     + [X] 4.多个实例做返回值
     + [X] 5.对象可以修改
     + [X] 6.复制
     + [X] 7.debug 调试
     + [ ] 8.练习
   + [X] 16.类和函数[5/5]
     + [X] 1.Time
     + [X] 2.纯函数
     + [X] 3.修改器
     + [X] 4.原型与规划
     + [X] 5.调试
   + [-] 17.类和方法
     + [ ] 1.面向对象的特征
     + [ ] 2.输出对象
     + [ ] 3.另外一个例子
     + [ ] 4.更多复杂的例子
     + [X] 5.init 方法
     + [X] 6.str 方法
     + [X] 7.运算符重载
     + [X] 8.根据对象类型进行运算
     + [ ] 9.多态
     + [ ] 10.调试
     + [ ] 11.接口和实现

* TODO learn go
  SCHEDULED: <2016-06-04 周六     +1d>
  :PROPERTIES:
  :LAST_REPEAT: [2016-06-04 周六 23:24]
  :END:
  - State "DONE"       from "TODO"       [2016-06-04 周六 23:24]
  - State "DONE"       from "TODO"       [2016-06-02 周四 14:43]
  - State "DONE"       from "TODO"       [2016-05-27 周五 11:59]
  - State "DONE"       from "TODO"       [2016-05-26 周四 10:28]
  - State "DONE"       from "TODO"       [2016-05-23 周一 14:39]
  - State "DONE"       from "TODO"       [2016-05-18 周三 15:56]
  - State "DONE"       from "TODO"       [2016-05-19 周四 23:16]
  - State "DONE"       from "TODO"       [2016-05-17 周二 17:55]
  - State "DONE"       from "TODO"       [2016-05-11 周三 17:09]
  - State "DONE"       from "TODO"       [2016-05-11 周三 14:22]
  - State "DONE"       from "TODO"       [2016-05-10 周二 15:26]
  - State "DONE"       from "TODO"       [2016-05-06 周五 16:41]
  - State "DONE"       from "TODO"       [2016-05-06 周五 09:37]
  - State "DONE"       from "TODO"       [2016-05-03 周二 10:35]
  - State "DONE"       from "TODO"       [2016-05-03 周二 10:23]
  - State "DONE"       from "TODO"       [2016-04-30 日 01:35]
  - State "DONE"       from "TODO"       [2016-04-29 周五 11:10]
  - State "DONE"       from "TODO"       [2016-04-28 周四 10:21]
  - State "DONE"       from "TODO"       [2016-04-27 周三 17:36]
  - State "DONE"       from "TODO"       [2016-04-26 周二 16:46]
  - State "DONE"       from "TODO"       [2016-04-22 周五 12:00]
  - State "DONE"       from "TODO"       [2016-04-21 周四 15:36]
  - State "DONE"       from "TODO"       [2016-04-20 周三 16:33]
  - State "DONE"       from "TODO"       [2016-04-18 周一 10:21]
  - State "DONE"       from "TODO"       [2016-04-17 日 15:31]
  - State "DONE"       from "TODO"       [2016-04-15 周五 15:34]
  - State "DONE"       from "TODO"       [2016-04-13 周三 15:26]
  - State "DONE"       from "TODO"       [2016-04-08 周五 17:33]
  - State "DONE"       from "TODO"       [2016-04-07 周四 10:10]
  - State "DONE"       from "TODO"       [2016-04-06 周三 14:02]
  - State "DONE"       from "TODO"       [2016-04-05 周二 12:01]
  - State "DONE"       from "TODO"       [2016-04-04 一 12:31]
  - State "DONE"       from "TODO"       [2016-04-01 周五 11:00]
  - State "DONE"       from "TODO"       [2016-03-31 周四 11:51]
  - State "DONE"       from "TODO"       [2016-03-30 周三 09:59]
  :LOGBOOK:
  CLOCK: [2016-06-04 周六 22:55]--[2016-06-04 周六 23:20] =>  0:25
  CLOCK: [2016-06-02 周四 14:15]--[2016-06-02 周四 14:40] =>  0:25
  CLOCK: [2016-05-27 周五 11:30]--[2016-05-27 周五 11:55] =>  0:25
  CLOCK: [2016-05-26 周四 10:02]--[2016-05-26 周四 10:27] =>  0:25
  CLOCK: [2016-05-23 周一 14:10]--[2016-05-23 周一 14:35] =>  0:25
  CLOCK: [2016-05-18 周三 15:18]--[2016-05-18 周三 15:43] =>  0:25
  CLOCK: [2016-05-17 周二 17:28]--[2016-05-17 周二 17:53] =>  0:25
  CLOCK: [2016-05-11 周三 16:18]--[2016-05-11 周三 16:43] =>  0:25
  CLOCK: [2016-05-11 周三 13:51]--[2016-05-11 周三 14:16] =>  0:25
  CLOCK: [2016-05-10 周二 14:58]--[2016-05-10 周二 15:23] =>  0:25
  CLOCK: [2016-05-06 周五 16:15]--[2016-05-06 周五 16:40] =>  0:25
  CLOCK: [2016-05-06 周五 09:10]--[2016-05-06 周五 09:35] =>  0:25
  CLOCK: [2016-05-03 周二 10:23]--[2016-05-03 周二 10:35] =>  0:12
  CLOCK: [2016-05-03 周二 09:57]--[2016-05-03 周二 10:22] =>  0:25
  CLOCK: [2016-05-01 日 01:09]--[2016-05-01 日 01:34] =>  0:25
  CLOCK: [2016-04-29 周五 10:31]--[2016-04-29 周五 10:56] =>  0:25
  CLOCK: [2016-04-28 周四 09:54]--[2016-04-28 周四 10:19] =>  0:25
  CLOCK: [2016-04-27 周三 17:09]--[2016-04-27 周三 17:34] =>  0:25
  CLOCK: [2016-04-26 周二 16:19]--[2016-04-26 周二 16:44] =>  0:25
  CLOCK: [2016-04-22 周五 11:25]--[2016-04-22 周五 11:50] =>  0:25
  CLOCK: [2016-04-21 周四 15:07]--[2016-04-21 周四 15:32] =>  0:25
  CLOCK: [2016-04-20 周三 16:05]--[2016-04-20 周三 16:30] =>  0:25
  CLOCK: [2016-04-18 周一 09:50]--[2016-04-18 周一 10:15] =>  0:25
  CLOCK: [2016-04-17 日 15:05]--[2016-04-17 日 15:30] =>  0:25
  CLOCK: [2016-04-15 周五 14:55]--[2016-04-15 周五 15:20] =>  0:25
  CLOCK: [2016-04-13 周三 14:44]--[2016-04-13 周三 15:09] =>  0:25
  CLOCK: [2016-04-08 周五 17:06]--[2016-04-08 周五 17:31] =>  0:25
  CLOCK: [2016-04-07 周四 09:35]--[2016-04-07 周四 10:00] =>  0:25
  CLOCK: [2016-04-06 周三 13:36]--[2016-04-06 周三 14:01] =>  0:25
  CLOCK: [2016-04-05 11:35]--[2016-04-05 12:00] =>0:25 
  CLOCK: [2016-04-04 11:30]--[2016-04-04 11:55] => 0:25 
  CLOCK: [2016-04-01 周五 10:33]--[2016-04-01 周五 10:58] =>  0:25
  CLOCK: [2016-03-31 周四 11:22]--[2016-03-31 周四 11:47] =>  0:25
  CLOCK: [2016-03-30 周三 09:32]--[2016-03-30 周三 09:57] =>  0:25
  :END:
  + [-] [[https://github.com/astaxie/build-web-application-with-golang/blob/master/zh/preface.md][golang]] [15%]
    + [X] 2.go 语言基础[8/8]
      + [X] 2.1 你好 go
      + [X] 2.2go 基础
      + [X] 2.3 流程和函数
      + [X] 2.4struct
      + [X] 2.5 面向对象
      + [X] 2.6interface command-ok switch
      + [X] 2.7 并发
      + [X] 2.8 小结
    + [-] 3.web 基础[3/5]
      + [X] 1.web 的工作方式
      + [X] 2.go 搭建 web 服务器
      + [X] 3.go 如何使得 web 工作
      + [ ] 4.go 的 http 包解析
      + [ ] 5.小结
    + [X] 4.表单[5/5]
      + [X] 1.form input
      + [X] 2.验证表单的输入
      + [X] 3.防止跨站脚本
      + [X] 4.防止多次提交表单
      + [X] 5.处理文件上传
    + [-] 5.访问数据库
      + [ ] database/sql 接口 
      + [X] mysql
      + [X] sqlite
      + 
    + [-] 6.session 和数据存储[2/5]
      + [X] session 和 cookie
      + [X] Go 如何使用 session
      + [ ] session 存储
      + [ ] 预防 session 劫持
      + [ ] 小结
    + [ ] 7.文本文件处理
    + [ ] 8.web 服务
    + [ ] 9.安全与加密
    + [ ] 10.国际化和本地化
    + [ ] 11.错误处理.调试和测试
    + [ ] 12.部署与维护
    + [ ] 13.如何设计一个 web 框架
    + [ ] 14.扩展 web 框架
* TODO learn js
  SCHEDULED: <2016-04-16 周六  +1d>
  :PROPERTIES:
  :LAST_REPEAT: [2016-05-03 周二 16:25]
  :Effort:
  :END:
  - State "DONE"       from "TODO"       [2016-05-03 周二 16:25]
  - State "DONE"       from "TODO"       [2016-05-01 日 16:46]
  - State "DONE"       from "TODO"       [2016-04-13 周三 16:25] 下一节 正则表达式
  - State "DONE"       from "TODO"       [2016-04-08 周五 16:59] 下一节 date 对象
  - State "DONE"       from "TODO"       [2016-04-07 周四 11:37] dom 节点
  - State "DONE"       from "TODO"       [2016-04-06 周三 15:07]
  - State "DONE"       from "TODO"       [2016-04-04 一 16:24]
  - State "DONE"       from "TODO"       [2016-04-01 周五 11:50] js 对象
  - State "DONE"       from "TODO"       [2016-03-31 周四 10:20]
  :LOGBOOK:
  CLOCK: [2016-05-03 周二 15:58]--[2016-05-03 周二 16:23] =>  0:25
  CLOCK: [2016-05-01 日 16:19]--[2016-05-01 日 16:44] =>  0:25
  CLOCK: [2016-04-13 周三 15:58]--[2016-04-13 周三 16:23] =>  0:25
  CLOCK: [2016-04-08 周五 16:32]--[2016-04-08 周五 16:57] =>  0:25
  CLOCK: [2016-04-07 周四 11:09]--[2016-04-07 周四 11:34] =>  0:25
  CLOCK: [2016-04-06 周三 14:41]--[2016-04-06 周三 15:06] =>  0:25
  CLOCK: [2016-04-04 周日 16:00]--[2016-04-04 周日 16:25] => 0:25
  CLOCK: [2016-04-01 周五 11:24]--[2016-04-01 周五 11:49] =>  0:25
  CLOCK: [2016-03-31 周四 09:53]--[2016-03-31 周四 10:18] =>  0:25
  :END:
  [[http://www.w3school.com.cn/js/js_intro.asp][js]]
  + [-] js
    + [X] js window [8/8]
      + [X] js window 浏览器的 宽高等
      + [X] js Screen 屏幕
      + [X] js Location 
      + [X] js History  前进后退
      + [X] js Navigator 浏览器信息
      + [X] PopupAlert
      + [X] Timing
      + [X] Cookies
    + [X] js 库[3/3]
      + [X] js 库
      + [X] jQuery
      + [X] Prototype
    + [ ] js 实例和测验
    + [ ] 参考手册
    + [ ] js 课外书
* TODO 一些文章
  SCHEDULED: <2016-05-02 周一 +1d>
  :PROPERTIES:
  :LAST_REPEAT: [2016-05-05 周四 16:54]
  :END:
  - State "DONE"       from "TODO"       [2016-05-05 周四 16:54]
  - State "DONE"       from "TODO"       [2016-05-04 周三 15:25]
  - State "DONE"       from "TODO"       [2016-04-29 周五 15:59]
  - State "DONE"       from "TODO"       [2016-04-28 周四 15:08]
  :LOGBOOK:
  CLOCK: [2016-05-05 周四 16:27]--[2016-05-05 周四 16:52] =>  0:25
  CLOCK: [2016-05-04 周三 14:54]--[2016-05-04 周三 15:19] =>  0:25
  CLOCK: [2016-04-29 周五 15:35]--[2016-04-29 周五 15:59] =>  0:24
  CLOCK: [2016-04-28 周四 14:37]--[2016-04-28 周四 15:02] =>  0:25
  CLOCK: [2016-04-22 周五 15:48]--[2016-04-22 周五 16:13] =>  0:25
  CLOCK: [2016-04-15 周五 13:42]--[2016-04-15 周五 14:07] =>  0:25
  :END:
  + [ ] Coordinatorlayout[[http://jcodecraeer.com/a/anzhuokaifa/androidkaifa/2015/0818/3315.html][快速返回]]
  + [ ] 内存优化[[http://jcodecraeer.com/a/anzhuokaifa/androidkaifa/2015/1216/3778.html][优化]]
    + [ ] [[http://jcodecraeer.com/a/anzhuokaifa/androidkaifa/2015/1226/3807.html][realm for android]]
    + [ ] [[http://jcodecraeer.com/a/anzhuokaifa/androidkaifa/2015/1201/3740.html][scalpel]]
    + [ ] [[http://jcodecraeer.com/a/anzhuokaifa/androidkaifa/2016/0325/4078.html][lambda]]
    + [ ] [[http://frank-zhu.github.io/android/2015/02/26/android-recyclerview-part-3/][recyclerview 使用详解]]
    + [ ] [[http://www.2cto.com/kf/201506/407276.html][toolbar]]
  + [-] 网络请求
    + [X] [[http://www.jianshu.com/p/3141d4e46240?hmsr=toutiao.io&utm_medium=toutiao.io&utm_source=toutiao.io][网络请求心路历程]]
    + [ ] [[http://www.jcodecraeer.com/a/anzhuokaifa/androidkaifa/2015/1016/3588.html][retrofit]]
    + [ ] [[http://developer.android.com/intl/zh-cn/samples/DisplayingBitmaps/src/com.example.android.displayingbitmaps/util/DiskLruCache.html][google samples diskLruCache]]
    + 
    + 
  + [ ] 多线程
    + [ ] [[http://www.cnblogs.com/codingmyworld/archive/2011/09/12/2174255.html][handler 消息处理机制]]
      + [ ] threadlocal http://qifuguang.me/2015/09/02/[Java%E5%B9%B6%E5%8F%91%E5%8C%85%E5%AD%A6%E4%B9%A0%E4%B8%83]%E8%A7%A3%E5%AF%86ThreadLocal/
      + [ ] [[http://www.cnblogs.com/dolphin0520/p/3920407.html][threadlocal]]
      + [ ]
  + [ ] webview js
    + [ ] [[https://mthli.github.io/Android-WebView-JavaScript][webview&js]]
  + [ ] theme 等
    + [ ] [[http://www.jianshu.com/p/61b79e7f88fc][attr]]
* TODO english
** TODO 语法[0%]
SCHEDULED: <2016-05-20  +1d>
   :PROPERTIES:
   :LAST_REPEAT: [2016-05-19 周四 23:12]
   :END:
   - State "DONE"       from "TODO"       [2016-05-19 周四 23:12] review
   - State "DONE"       from "TODO"       [2016-04-30 六 23:43]
   - State "DONE"       from "TODO"       [2016-04-28 四 23:20]
   - State "DONE"       from "TODO"       [2016-04-27 三 06:39]
   :LOGBOOK:
   CLOCK: [2016-05-19 周四 22:44]--[2016-05-19 周四 23:09] =>  0:25
   CLOCK: [2016-04-30 六 23:21]--[2016-04-30 六 23:43] =>  0:22
   CLOCK: [2016-04-30 日 18:46]--[2016-04-30 六 23:21] => 0:16
   CLOCK: [2016-04-29 五 22:39]--[2016-04-29 五 23:04] =>  0:25
   CLOCK: [2016-04-28 四 22:50]--[2016-04-28 四 23:15] =>  0:25
CLOCK: [2016-04-27 三 06:11]--[2016-04-27 三 06:36] =>  0:25
:END:
   + [-] 1.句子的组成[33%]
     + [X] 1.可做主语的词 p9
       + [X] 1.名词
       + [X] 2.代词
       + [X] 3.动名词或不定式
       + [X] 4.名词性从句
       + [X] 5.名词短语
       + [X] 6.表距离的地方副词
     + [-] 2.动词的种类及用法[50%]
       + [X] 1.动词可分为 5 类
       + [X] 2.判断完全不及物动词
       + [X] 3.兼做及物与不及物动词之常用动词
       + [X] 4.不及物动词可做及物动词，用同系名词作其宾语
       + [X] 5.完全及物动词与完全不及物动词
       + [X] 6.完全及物动词出现的形态
       + [X] 7.完全不及物动词出现的形态
       + [X] 8.不完全不及物动词 is
       + [X] 9.不完全不及物动词 incomplete intransitive verb i.iv
       + [X] 10.不完全不及物动词及其表语的用法 be become turn get seem 感官动词 
       + [ ] 11.不完全不及物动词的重要相关短语
       + [ ] 12.完全及物动词
       + [ ] 13.完全及物动词的用法
       + [ ] 14.不完全及物动词
       + [ ] 15.不完全及物动词的分类及用法
       + [ ] 16.授予动词
       + [ ] 17.间接宾语语直接宾语倒置原则
       + [ ] 18.与 of 连用的授予动词
       + [ ] 19.表"提供"的授予动词
       + [ ] 20.其他补充要点
     + [ ] 3.结论
   + [ ] 2.两句的连接方式
   + [ ] 3.关系词
   + [ ] 4.非谓语动词
   + [ ] 5.助动词及易用错的动词
   + [ ] 6.时态及语态
   + [ ] 7.虚拟语气
   + [ ] 8.副词
   + [ ] 9.倒装结构
   + [ ] 10.比较结构
   + [ ] 11.代词
   + [ ] 12.复合形容词
   + [ ] 13.介词用法
   + [ ] 14.反意疑问句
  
** DONE [[http://orgmode.org/manual/Document-Structure.html#Document-Structure][org-manual]]
   CLOSED: [2016-05-03 周二 09:46] SCHEDULED: <2016-04-28 周四 >
   :PROPERTIES:
   :LAST_REPEAT: [2016-05-03 周二 09:46]
   :END:
   - State "DONE"       from "TODO"       [2016-05-03 周二 09:46]
* TODO books
** TODO 世界为何
SCHEDULED: <2016-06-03 周三 +1d>
:PROPERTIES:
:LAST_REPEAT: [2016-06-02 周四 23:27]
:END:
- State "DONE"       from "TODO"       [2016-06-02 周四 23:27]
- State "DONE"       from "TODO"       [2016-05-31 周二 23:33]56
- State "DONE"       from "TODO"       [2016-05-26 周四 23:45]45
- State "DONE"       from "TODO"       [2016-05-26 周四 23:35]
- State "DONE"       from "TODO"       [2016-05-19 周四 23:44]34
- State "DONE"       from "TODO"       [2016-05-04 三 21:22]
- State "DONE"       from "TODO"       [2016-04-27 三 07:31]
:LOGBOOK:
CLOCK: [2016-06-02 周四 22:50]--[2016-06-02 周四 23:15] =>  0:25
CLOCK: [2016-05-31 周二 23:07]--[2016-05-31 周二 23:32] =>  0:25
CLOCK: [2016-05-26 周四 23:17]--[2016-05-26 周四 23:35] =>  0:18
CLOCK: [2016-05-19 周四 23:17]--[2016-05-19 周四 23:42] =>  0:25
CLOCK: [2016-05-04 三 20:56]--[2016-05-04 三 21:21] =>  0:25
CLOCK: [2016-04-27 三 07:05]--[2016-04-27 三 07:30] =>  0:25
:END:
** TODO 生活中的心里学
SCHEDULED: <2016-05-05 四 +1d>
:PROPERTIES:
:LAST_REPEAT: [2016-05-04 三 23:08]
:END:
- State "DONE"       from "TODO"       [2016-05-04 三 23:08]  6
:LOGBOOK:
CLOCK: [2016-05-04 三 22:41]--[2016-05-04 三 23:06] =>  0:25
:END:

+ [ ] 1.心里学与生活  
* TODO blog
  SCHEDULED: <2016-05-06 周二 +1d>
  :PROPERTIES:
  :LAST_REPEAT: [2016-05-06 周五 11:04]
  :Effort:
  :END:
  - State "DONE"       from "TODO"       [2016-05-06 周五 11:04]
  - State "DONE"       from "TODO"       [2016-05-04 周三 11:19]
  - State "DONE"       from "TODO"       [2016-05-01 日 13:19]
  - State "DONE"       from "TODO"       [2016-04-29 周五 09:42]
  - State "DONE"       from "TODO"       [2016-04-28 周四 11:57]
  :LOGBOOK:
  CLOCK: [2016-05-06 周五 10:29]--[2016-05-06 周五 10:54] =>  0:25
  CLOCK: [2016-05-04 周三 10:15]--[2016-05-04 周三 10:40] =>  0:25
  CLOCK: [2016-05-01 日 12:50]--[2016-05-01 日 13:15] =>  0:25
  CLOCK: [2016-04-29 周五 09:04]--[2016-04-29 周五 09:29] =>  0:25
  CLOCK: [2016-04-28 周四 11:15]--[2016-04-28 周四 11:40] =>  0:25
  :END:
  [[http://yifeiyuan.me/2015/08/08/Hexo%E6%90%AD%E5%BB%BA%E5%8D%9A%E5%AE%A2%E4%B9%8B%E6%97%85/?hmsr=toutiao.io&utm_medium=toutiao.io&utm_source=toutiao.io][hexo]]
  [[https://hexo.io/zh-cn/index.html][官网]]
  [[http://wuchong.me/blog/2014/11/20/how-to-use-jacman/][jacman-themes]]
  [[http://www.bkjia.com/Javascript/986418.html][github]]
* Coursera
** TODO learn how to learn [50%]
   SCHEDULED: <2016-05-07 周六 +1d>
   :PROPERTIES:
   :LAST_REPEAT: [2016-06-06 周一 17:26]
   :END:
   - State "DONE"       from "TODO"       [2016-06-06 周一 17:26]
   - State "DONE"       from "TODO"       [2016-05-19 周四 00:14]
   - State "DONE"       from "TODO"       [2016-05-17 周二 00:42]
   - State "DONE"       from "TODO"       [2016-05-15 周日 23:55]
   - State "DONE"       from "TODO"       [2016-05-02 一 11:41]
   - State "DONE"       from "TODO"       [2016-05-01 日 11:10]
   
   - [X] week1[3/3]
     + [X] Focused versus Diffuse Thinking
     + [X] Procrastination,Memory,and Sleep
     + [X] Summary
   - [X] week2[2/2]
     + [X] chunking 
     + [X] seeing the Bigger Picture
       + [X] what motivates you?
       + [X] the valule of library of chunks
       + [X] overlearing,Choking,Einstellung,and Interleaving
       + [X] summary
   - [-] week3[4/5]
     + [X] Procrastination and Memory
     + [X] Trackling Procrastination
     + [X] Zombies Everywhere
     + [X] Surf's up:Process Versus Product
     + [ ] Harnessing your Zombies to Help you

   :LOGBOOK:
   CLOCK: [2016-05-18 周三 23:46]--[2016-05-19 周四 00:11] =>  0:25
   CLOCK: [2016-05-17 周二 00:05]--[2016-05-17 周二 00:30] =>  0:25
   CLOCK: [2016-05-15 周日 23:24]--[2016-05-15 周日 23:49] =>  0:25
   CLOCK: [2016-05-04 三 23:26]--[2016-05-04 三 23:51] =>  0:25
   CLOCK: [2016-05-02 一 11:05]--[2016-05-02 一 11:30] =>  0:25
   CLOCK: [2016-05-01 日 10:25]--[2016-05-01 日 11:05] =>  0:40
   :END:+ [ ] week4
[[https://www.coursera.org/learn/learning-how-to-learn/lecture/mrPn2/the-value-of-a-library-of-chunks][url]]
** TODO [[https://www.coursera.org/][html,css,andJsp]]
SCHEDULED: <2016-06-08 周三 +1d>
:PROPERTIES:
:LAST_REPEAT: [2016-06-07 周二 21:24]
:END:
- State "DONE"       from "TODO"       [2016-06-07 周二 21:24]
- State "DONE"       from "TODO"       [2016-06-06 周一 17:26]
:LOGBOOK:
CLOCK: [2016-06-07 周二 20:58]--[2016-06-07 周二 21:23] =>  0:25
CLOCK: [2016-06-06 周一 16:55]--[2016-06-06 周一 17:20] =>  0:25
:END:
** TODO [[https://www.coursera.org/learn/game-development/lecture/nDlKv/meet-the-instructor-brian-winn][game design]]
SCHEDULED: <2016-06-08 周三 +1d>
:PROPERTIES:
:LAST_REPEAT: [2016-06-07 周二 23:48]
:END:
- State "DONE"       from "TODO"       [2016-06-07 周二 23:48]
- State "DONE"       from "TODO"       [2016-06-06 周一 19:00]
:LOGBOOK:
CLOCK: [2016-06-29 周三 13:00]--[2016-06-29 周三 13:00] =>  0:00
CLOCK: [2016-06-07 周二 21:48]--[2016-06-07 周二 22:14] =>  0:26
CLOCK: [2016-06-06 周一 18:07]--[2016-06-06 周一 18:32] =>  0:25
:END:
** TODO node
   SCHEDULED: <2016-06-29 周三 +1d>
   :PROPERTIES:
   :LAST_REPEAT: [2016-06-23 周四 16:38]
   :END:
   - State "DONE"       from "TODO"       [2016-06-23 周四 16:38]
   - State "DONE"       from "TODO"       [2016-06-21 周二 17:46]
   - State "DONE"       from "TODO"       [2016-06-21 周二 15:11]
   - State "DONE"       from "TODO"       [2016-06-21 周二 14:28]
   - State "DONE"       from "TODO"       [2016-06-21 周二 11:06]
   - State "DONE"       from "TODO"       [2016-06-21 周二 10:17]
   - State "DONE"       from "TODO"       [2016-06-16 周四 17:45]
   - State "DONE"       from "TODO"       [2016-06-16 周四 15:52]
   - State "DONE"       from "TODO"       [2016-06-16 周四 15:17]
   - State "DONE"       from "TODO"       [2016-06-16 周四 14:26]
   - State "DONE"       from "TODO"       [2016-06-16 周四 13:33]
   - State "DONE"       from "TODO"       [2016-06-14 周二 18:01]
   - State "DONE"       from "TODO"       [2016-06-14 周二 16:32]
   - State "DONE"       from "TODO"       [2016-06-14 周二 15:20]
   - State "DONE"       from "TODO"       [2016-06-14 周二 11:21]
   - State "DONE"       from "TODO"       [2016-06-13 周一 17:52]
   - State "DONE"       from "TODO"       [2016-06-13 周一 17:15]
   :LOGBOOK:
   CLOCK: [2016-06-23 周四 16:43]--[2016-06-23 周四 17:08] =>  0:25
   CLOCK: [2016-06-23 周四 16:11]--[2016-06-23 周四 16:36] =>  0:25
   CLOCK: [2016-06-21 周二 16:40]--[2016-06-21 周二 17:05] =>  0:25
   CLOCK: [2016-06-21 周二 15:17]--[2016-06-21 周二 15:42] =>  0:25
   CLOCK: [2016-06-21 周二 14:28]--[2016-06-21 周二 14:53] =>  0:25
   CLOCK: [2016-06-21 周二 11:45]--[2016-06-21 周二 12:10] =>  0:25
   CLOCK: [2016-06-21 周二 10:18]--[2016-06-21 周二 10:43] =>  0:25
   CLOCK: [2016-06-21 周二 09:43]--[2016-06-21 周二 10:08] =>  0:25
   CLOCK: [2016-06-16 周四 17:16]--[2016-06-16 周四 17:41] =>  0:25
   CLOCK: [2016-06-16 周四 15:24]--[2016-06-16 周四 15:49] =>  0:25
   CLOCK: [2016-06-16 周四 14:44]--[2016-06-16 周四 15:09] =>  0:25
   CLOCK: [2016-06-16 周四 13:36]--[2016-06-16 周四 14:01] =>  0:25
   CLOCK: [2016-06-16 周四 11:15]--[2016-06-16 周四 11:40] =>  0:25
   CLOCK: [2016-06-14 周二 17:17]--[2016-06-14 周二 17:42] =>  0:25
   CLOCK: [2016-06-14 周二 16:01]--[2016-06-14 周二 16:26] =>  0:25
   CLOCK: [2016-06-14 周二 11:28]--[2016-06-14 周二 11:53] =>  0:25
   CLOCK: [2016-06-14 周二 10:48]--[2016-06-14 周二 11:13] =>  0:25
   CLOCK: [2016-06-13 周一 16:54]--[2016-06-13 周一 17:15] =>  0:21
   CLOCK: [2016-06-13 周一 15:20]--[2016-06-13 周一 15:45] =>  0:25
   CLOCK: [2016-06-13 周一 09:37]--[2016-06-13 周一 10:02] =>  0:25
   CLOCK: [2016-06-12 周日 11:08]--[2016-06-12 周日 11:33] =>  0:25
   :END:
** TODO computational-investing
SCHEDULED: <2016-06-30 周四 +1d>
:PROPERTIES:
:LAST_REPEAT: [2016-06-29 周三 14:07]
:END:
- State "DONE"       from "TODO"       [2016-06-29 周三 14:07]
:LOGBOOK:
CLOCK: [2016-06-29 周三 13:41]--[2016-06-29 周三 14:06] =>  0:25
:END:
*** prerequire
**** TODO [[https://www.coursera.org/learn/financial-markets-intro/home/welcome][Introduction to Financial Markets]]
SCHEDULED: <2016-07-04 周一 +1d>
:PROPERTIES:
:LAST_REPEAT: [2016-06-30 周四 18:52]
:END:
- State "DONE"       from "TODO"       [2016-06-30 周四 18:52]
- State "DONE"       from "TODO"       [2016-06-30 周四 17:22]
- State "DONE"       from "TODO"       [2016-06-30 周四 12:49]
- State "DONE"       from "TODO"       [2016-06-29 周三 19:37]
- State "DONE"       from "TODO"       [2016-06-29 周三 18:27]
:LOGBOOK:
CLOCK: [2016-06-30 周四 18:19]--[2016-06-30 周四 18:44] =>  0:25
CLOCK: [2016-06-30 周四 16:42]--[2016-06-30 周四 17:07] =>  0:25
CLOCK: [2016-06-30 周四 12:19]--[2016-06-30 周四 12:44] =>  0:25
CLOCK: [2016-06-29 周三 19:05]--[2016-06-29 周三 19:30] =>  0:25
CLOCK: [2016-06-29 周三 18:00]--[2016-06-29 周三 18:25] =>  0:25
:END:
** C
*** TODO [[https://www.coursera.org/learn/jisuanji-biancheng/home/welcome][计算机导论与c语言基础]]
SCHEDULED: <2016-07-01 周五 +1d>
:PROPERTIES:
:LAST_REPEAT: [2016-06-30 周四 11:35]
:END:
- State "DONE"       from "TODO"       [2016-06-30 周四 11:35]
- State "DONE"       from "TODO"       [2016-06-29 周三 20:11]
:LOGBOOK:
CLOCK: [2016-06-30 周四 10:51]--[2016-06-30 周四 11:16] =>  0:25
CLOCK: [2016-06-29 周三 19:46]--[2016-06-29 周三 20:11] =>  0:25
:END:

* TODO learn git
  SCHEDULED: <2016-05-06 周二 16:00-16:30 +1d>
  :PROPERTIES:
  :LAST_REPEAT: [2016-05-06 周五 12:26]
  :END:
  - State "DONE"       from "TODO"       [2016-05-06 周五 12:26]
  - State "DONE"       from "TODO"       [2016-03-18 周五 17:47]
  - State "DONE"       from "TODO"       [2016-03-17 周四 17:25]
  - State "DONE"       from "TODO"       [2016-03-15 周二 17:32]
  - State "DONE"       from "TODO"       [2016-03-14 周一 16:33]
  :LOGBOOK:
  CLOCK: [2016-05-06 周五 11:47]--[2016-05-06 周五 12:12] =>  0:25
  CLOCK: [2016-03-18 周五 17:19]--[2016-03-18 周五 17:44] =>  0:25
  CLOCK: [2016-03-17 周四 16:59]--[2016-03-17 周四 17:24] =>  0:25
  CLOCK: [2016-03-15 周三 17:02]--[2016-03-16 周三 18:00] =>  0:25
  CLOCK: [2016-03-14 周一 16:06]--[2016-03-14 周一 16:32] =>  0:25
  :END:
  [[http://www.gitref.org/zh/index.html][git manual]] 
  [[https://git-scm.com/book/zh/v2][gitbook]]
** DONE git 
   CLOSED: [2016-05-06 周五 10:11] SCHEDULED: <2016-04-18 一 >
   :PROPERTIES:
   :LAST_REPEAT: [2016-04-17 日 19:44]
   :END:
   - State "DONE"       from "TODO"       [2016-04-17 日 19:44]
   :LOGBOOK:
   CLOCK: [2016-04-17 日 19:17]--[2016-04-17 日 19:42] =>  0:25
   :END:
   廖雪峰[[http://www.liaoxuefeng.com/wiki/0013739516305929606dd18361248578c67b8067c8c017b000/001373962845513aefd77a99f4145f0a2c7a7ca057e7570000][git]]
** TODO githug
   SCHEDULED: <2016-06-04 周六  +1d>
   :PROPERTIES:
   :LAST_REPEAT: [2016-06-03 周五 17:31]
   :END:
   - State "DONE"       from "TODO"       [2016-06-03 周五 17:31]
   - State "DONE"       from "TODO"       [2016-06-02 周四 16:54]
   - State "DONE"       from "TODO"       [2016-05-23 周一 11:57]
   - State "DONE"       from "TODO"       [2016-05-18 周三 14:11]
   - State "DONE"       from "TODO"       [2016-05-17 周二 10:16]
   :LOGBOOK:
   CLOCK: [2016-06-03 周五 17:06]--[2016-06-03 周五 17:31] =>  0:25
   CLOCK: [2016-06-02 周四 16:27]--[2016-06-02 周四 16:52] =>  0:25
   CLOCK: [2016-05-23 周一 11:30]--[2016-05-23 周一 11:55] =>  0:25
   CLOCK: [2016-05-18 周三 11:37]--[2016-05-18 周三 12:02] =>  0:25
   CLOCK: [2016-05-17 周二 09:49]--[2016-05-17 周二 10:14] =>  0:25
   :END:
   [[http://fancyoung.com/blog/githug-cheat-sheet/][攻略]]
   [[http://www.zhenghe8.com/upload/admin/s][gitrebase]]
* DONE weichat 
  CLOSED: [2016-05-03 周二 09:15] SCHEDULED: <2016-04-07 周四 >
  :PROPERTIES:
  :LAST_REPEAT: [2016-04-06 周三 14:34]
  :END:
  - State "DONE"       from "TODO"       [2016-04-06 周三 14:34]
  :LOGBOOK:
  CLOCK: [2016-04-06 周三 14:09]--[2016-04-06 周三 14:34] =>  0:25
  :END:
  [[https://segmentfault.com/a/1190000000446237][weichat]]
  [[http://blog.csdn.net/pamchen/article/details/38718947][csdn]]
* TODO Android 7.4
  SCHEDULED: <2016-06-29 周三 +1d>
  :PROPERTIES:
  :LAST_REPEAT: [2016-06-20 周一 15:54]
  :END:
  - State "DONE"       from "TODO"       [2016-06-20 周一 15:54]
  - State "DONE"       from "TODO"       [2016-06-20 周一 15:31]
  - State "DONE"       from "TODO"       [2016-06-20 周一 13:30]
  - State "DONE"       from "TODO"       [2016-06-20 周一 11:11]
  - State "DONE"       from "TODO"       [2016-06-20 周一 10:36]
  - State "DONE"       from "TODO"       [2016-06-17 周五 17:59]
  - State "DONE"       from "TODO"       [2016-06-17 周五 17:36]
  - State "DONE"       from "TODO"       [2016-06-17 周五 16:46]
  - State "DONE"       from "TODO"       [2016-06-17 周五 15:35]
  - State "DONE"       from "TODO"       [2016-06-17 周五 14:55]
  - State "DONE"       from "TODO"       [2016-06-17 周五 14:13]
  - State "DONE"       from "TODO"       [2016-06-17 周五 11:59]
  :LOGBOOK:
  CLOCK: [2016-06-20 周一 15:00]--[2016-06-20 周一 15:25] =>  0:25
  CLOCK: [2016-06-20 周一 13:32]--[2016-06-20 周一 13:57] =>  0:25
  CLOCK: [2016-06-20 周一 11:34]--[2016-06-20 周一 11:59] =>  0:25
  CLOCK: [2016-06-20 周一 10:36]--[2016-06-20 周一 11:01] =>  0:25
  CLOCK: [2016-06-20 周一 09:52]--[2016-06-20 周一 10:17] =>  0:25
  CLOCK: [2016-06-17 周五 16:59]--[2016-06-17 周五 17:24] =>  0:25
  CLOCK: [2016-06-17 周五 15:38]--[2016-06-17 周五 16:03] =>  0:25
  CLOCK: [2016-06-17 周五 15:04]--[2016-06-17 周五 15:29] =>  0:25
  CLOCK: [2016-06-17 周五 14:24]--[2016-06-17 周五 14:49] =>  0:25
  CLOCK: [2016-06-17 周五 13:43]--[2016-06-17 周五 14:08] =>  0:25
  CLOCK: [2016-06-17 周五 11:29]--[2016-06-17 周五 11:54] =>  0:25
  :END:
  
  
  
  
